SengPhirum/PLXY_DrowsyGuard/firmware/esp32s3/sdkconfig.defaults
# Baseline config for the ESP32-S3-WROOM-1 N16R8 CAM board.
# `idf.py set-target esp32s3` seeds sdkconfig from this file. Delete sdkconfig (not
# this file) if you want to start over.

CONFIG_IDF_TARGET="esp32s3"

# --- 16 MB flash ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- 8 MB octal PSRAM ---
# Non-negotiable: the camera framebuffers live here (CAMERA_FB_IN_PSRAM) and so do
# the ESP-DL models. Get MODE_OCT wrong and the board boots but finds 0 bytes of
# PSRAM, which surfaces later as an unexplained esp_camera_init() failure.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
# Stays at 4096, and this is load-bearing: ESP-DL allocates its layer buffers with
# plain malloc and its TIE728 SIMD kernels cannot run against PSRAM. Lowering this
# to 1024 - which does free a useful amount of internal RAM - crashed the detector
# within seconds of boot, in dl_tie728_s8_conv2d.S and eye_model_infer(), with
# "Cache error" and "LoadProhibited" on core 1. If internal RAM is needed, take it
# from the Wi-Fi buffer counts below, not from here.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# How much internal RAM is fenced off for DMA-capable and internal-only
# allocations. IDF's default is 32768, and a boot-time census of this board showed
# that pool holding "allocated 0" - completely untouched - while the general
# internal pool sat at 10.9 kB free and HTTP handlers died inside malloc: fopen()
# aborting in newlib's lock_init_generic(), lwip_send() faulting on a socket mutex.
# The reserve is created with DMA/internal capabilities only, so generic malloc -
# which is what newlib, lwIP and esp-mqtt use - cannot draw on it however starved
# it gets. 8 kB is ample for what actually asks by capability here: the camera's
# framebuffers are in PSRAM (CAMERA_FB_IN_PSRAM) and its DMA descriptors are small.
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=8192

# --- performance ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y

# --- camera ---
# Three sensors, because the board does not reliably ship the one it is sold as.
# khmeres item 2991 is listed with an OV3660; the unit verified on 2026-08-23
# (MAC 80:b5:4e:c5:e0:18) actually carries an **OV5640** and reports
# "ov3660: Mismatch PID=0x5640" on the way to detecting it correctly. Both are
# pinned here rather than left to the component's defaults: OV5640 happens to
# default to y today, and losing it would look like a dead camera rather than a
# missing driver.
CONFIG_OV3660_SUPPORT=y
CONFIG_OV5640_SUPPORT=y
CONFIG_OV2640_SUPPORT=y
CONFIG_CAMERA_TASK_STACK_SIZE=4096

# --- models ---
# The face detector's weights are linked into the app binary rather than loaded
# from a partition. partitions.csv sizes the app partition at 6 MB for exactly this.
CONFIG_HUMAN_FACE_DETECT_MODEL_IN_FLASH_RODATA=y

# --- Wi-Fi + HTTP preview -------------------------------------------------
# The panel was replaced by a browser, so the radio and the TCP stack are now on
# the critical path for everything a developer or examiner can see. These are the
# esp32-camera web-server settings, and they are not optional decoration: with the
# stock buffer counts an MJPEG stream stalls for hundreds of milliseconds at a time
# and reads as a camera that cannot keep up.
# Internal DMA RAM at ~1600 B each. The RX pool stays at 8 and cannot go lower
# without also lowering CONFIG_ESP_WIFI_RX_BA_WIN, which ESP-IDF refuses to let
# exceed double this number - a build error, not a runtime surprise. The TX pool is
# where the reclaimable internal RAM actually was.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
# TX buffers are STATIC here, and that is forced rather than chosen: ESP-IDF makes
# ESP_WIFI_DYNAMIC_TX_BUFFER unavailable whenever SPIRAM_TRY_ALLOCATE_WIFI_LWIP is
# set (which it is, a few lines up), because dynamic buffers cannot be guaranteed
# once the Wi-Fi stack is allowed into PSRAM. Setting the derived
# CONFIG_ESP_WIFI_TX_BUFFER_TYPE directly does nothing - it is computed from the
# choice - so the knob that actually matters is the static count below.
# Was 24, for the MJPEG smoothness reason above. Dropped to 8 because these are
# internal DMA buffers at ~1600 B each and the board had 6.6 kB of internal heap
# left at idle - at which point the SoftAP could no longer allocate the per-station
# state to accept a client, and every association failed with "m f auth" /
# "removing station after unsuccessful auth/assoc". A device nobody can join is a
# worse camera than a slightly burstier stream. IDF's own default is 16.
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y

# NOTE on measuring these: a boot-time stack census is only valid for tasks that
# have already done their heaviest work. The httpd and event-writer high-water
# marks look enormous at boot purely because no request has been served yet, so
# they are not evidence for shrinking anything. This one stays at 4096.
#
# The task that dispatches every Wi-Fi and IP event, and the stack that `sys_evt`
# overflowed on v0.1.0: a client associating with the SoftAP crashed the board, so
# joining the provisioning access point rebooted the device it was there to
# configure. The 864-byte scan buffer that caused it is static now
# (board_wifi.cpp), which is the actual fix - but 2304 is the IDF default and it is
# thin for handlers that log, and a handler that logs is the only reason any of
# this is debuggable. 4 kB of internal RAM for the task the radio cannot run
# without is the cheapest 1.7 kB on the board.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# Two HTTP servers (control on :80, stream on :81), each with a handful of
# sockets, plus the DHCP server for the SoftAP - and one more for the MQTT client,
# which holds a socket whenever it is connected. (This was briefly set in two
# places, 16 here and 20 in the MQTT section; one definition, the larger one.)
CONFIG_LWIP_MAX_SOCKETS=20
# 65534 was the largest number the field takes, chosen when the constraint was
# thought to be MJPEG smoothness. It is a cap on how much lwIP may queue per
# connection, and on this board that ceiling is reachable: with a viewer streaming,
# free internal heap fell to ~8 kB and the HTTP handlers started dying inside
# malloc - fopen() aborting in newlib's lock_init_generic(), and lwip_send()
# faulting on a socket mutex. 16 kB is still four times the frame size and this
# device serves one viewer on a LAN.
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=16384
CONFIG_LWIP_TCP_WND_DEFAULT=16384
# 64 deep on every socket was ~256 B of internal RAM each across LWIP_MAX_SOCKETS,
# to absorb bursts this device does not produce: it serves one page and one stream.
CONFIG_LWIP_TCP_RECVMBOX_SIZE=16
CONFIG_LWIP_UDP_RECVMBOX_SIZE=16
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=32

# The status JSON is a single ~1 kB response and the query strings are short, but
# a browser's own request headers are not: leave room for them.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# --- app ---
# app_main runs the capture loop directly, and BehaviorAnalyzer/Perclos keep a few
# KB of rolling buffers on the stack path.
# 12288, up from 8192, and this one goes the other way on purpose: a boot-time
# census measured main's stack high-water mark at 136 bytes of remaining headroom.
# app_main runs the capture loop, the detector calls and BehaviorAnalyzer, and 136
# bytes is not a margin - it is the next stack frame away from the crash this
# firmware already had once, in sys_evt.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288

# The camera + LCD current spike on a marginal USB cable trips the brownout
# detector mid-init. Lower the threshold rather than chasing phantom camera faults;
# raise it back for the final power-supply validation.
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_4=y

# --- MQTT alerting --------------------------------------------------------
# esp-mqtt ships with ESP-IDF, but three of the four transports this feature
# offers are behind Kconfig options that default to off, and a transport that is
# compiled out fails at connect time with a generic transport error rather than
# "not built" - which is a long afternoon.
#
# WebSocket is not a nicety here: the documentation's fleet page is a browser, and
# a browser cannot open a raw MQTT socket at all. WSS is what a page served over
# HTTPS is *required* to use, so both halves have to be in.
CONFIG_MQTT_TRANSPORT_SSL=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET_SECURE=y

# MQTT 5 is offered as a choice in the settings modal, so it has to be compiled
# in; the default protocol is still 3.1.1, which every broker speaks.
CONFIG_MQTT_PROTOCOL_5=y

# esp-mqtt's client task is where DNS, the TCP connect and the ENTIRE TLS handshake
# run, at priority 5 - and with core selection off it is created with no affinity.
# Landing on core 0 puts a second or more of mbedtls arithmetic above app_main
# (priority 1), which freezes capture and inference for the duration of every
# handshake - and our own backoff repeats that handshake for as long as a broker is
# unreachable, so a dead broker read as a detector that periodically hangs. Pinned
# to core 1 it shares the core with the web servers (also priority 5) and the
# publisher task, and costs the detector nothing. This is the same rule every other
# network task in this firmware already follows: web_server.cpp pins both httpd
# servers and the event writer to core 1 for the same reason.
CONFIG_MQTT_TASK_CORE_SELECTION_ENABLED=y
CONFIG_MQTT_USE_CORE_1=y

# Frees the broker's certificate chain once the handshake has verified it, ~4 kB of
# heap per live TLS connection that was previously held for the whole session.
# Nothing here reads the peer certificate after connect: esp-mqtt does not, and the
# bundle's verification callback runs during the handshake, before the free.
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n

# The outbox is esp-mqtt's own QoS 1 retransmission buffer, underneath our
# 16-event MqttOutbox. 8 kB is roughly twenty alert payloads in flight, which is
# more than the 16 our own buffer will ever hand over at once.
CONFIG_MQTT_OUTBOX_EXPIRED_TIMEOUT_MS=30000
CONFIG_MQTT_CUSTOM_OUTBOX=n

# The Mozilla root bundle, in flash. This is what makes the preconfigured public
# broker reachable over TLS *with* server verification and no certificate pasted
# in - the alternative is shipping a default that only works with verification
# switched off, which is how "TLS" quietly becomes "encrypted to somebody".
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# SNTP is not enabled and the payload says so. There is no RTC on this board, so a
# device that has never reached a time server publishes "ts":"" and
# "ts_source":"uptime" rather than a timestamp in 1970 - see
# mqtt_config.cpp:mqtt_iso8601(). uptime_ms is always present and is what the
# fleet page orders events by.
